app/controllers/alignments_controller.rb

SELECT * FROM "alignments"
---
  def index
    @alignments = Alignment.all

SELECT * FROM "alignments" WHERE ("alignments"."id" = 1)
---
  def show
    @alignment = Alignment.find(params[:id])

INSERT INTO "alignments" ("updated_at", "title", "created_at") VALUES('2010-08-24 23:43:27', 'Lawful Good', '2010-08-24 23:43:27')
---
  def create
    @alignment = Alignment.new(params[:alignment])

    respond_to do |format|
      if @alignment.save