app/controllers/characters_controller.rb

  def index
    @characters = Character.all
---
SELECT * FROM "characters"

  def show
    @character = Character.find(params[:id])
---
SELECT * FROM "characters" WHERE ("characters"."id" = 1)

  def edit
    @character = Character.find(params[:id])
---
SELECT * FROM "characters" WHERE ("characters"."id" = 1)

  def create
    @character = current_user.characters.new(params[:character])

    respond_to do |format|
      if @character.save
---
INSERT INTO "characters" ("skill_climb", "skill_use_magic_device", "DEX", "race", "skill_knowledge_local", "skill_heal", "skill_perform", "CHA", "skill_jump", "deity", "skill_knowledge_history", "user_id", "weight", "CON", "skill_knowledge_architecture", "skill_handle_animal", "level", "skill_decipher_script", "height", "gender", "age", "skill_hide", "skill_bluff", "INT", "updated_at", "alignment", "skill_disable_device", "skill_survival", "skill_speak_language", "skill_tumble", "skill_knowledge_arcana", "skill_knowledge_planes", "skill_gather_information", "skill_appraise", "skill_escape_artist", "name", "skill_balance", "eyes", "skill_use_rope", "skill_intimidate", "STR", "skill_knowledge_religion", "skill_profession", "skill_spot", "skill_knowledge_nature", "skill_search", "hair", "WIS", "skill_open_lock", "skill_knowledge_dungeoneering", "skill_spellcraft", "skill_sense_motive", "skill_swim", "klass", "created_at", "skill_listen", "skill_craft", "skill_move_silently", "skill_forgery", "skill_disguise", "skill_knowledge_geography", "skill_sleight_of_hand", "skill_ride", "skill_knowledge_nobility", "campaign_id", "skill_diplomacy", "skill_concentration") VALUES(0, 0, 15, 'Halfling', 0, 0, 0, 17, 0, 'Atheist', 0, 2, NULL, 18, 0, 0, 1, 0, NULL, 'Male', 22, 0, 0, 12, '2010-08-03 22:01:37', 'Neutral Good', 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Frod Baggins', 0, NULL, 0, 0, 9, 0, 0, 0, 0, 0, NULL, 12, 0, 0, 0, 0, 0, 'Rogue', '2010-08-03 22:01:37', 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0)

  def update
    @character = current_user.characters.find(params[:id])

    respond_to do |format|
      if @character.update_attributes(params[:character])
---
SELECT * FROM "characters" WHERE ("characters"."id" = 1)
UPDATE "characters" SET "charisma" = 12, "strength" = 12, "race" = 'Human', "dexterity" = 12, "klass" = 'Bard', "intelligence" = 12, "constitution" = 12, "updated_at" = '2010-07-20 22:30:50', "wisdom" = 12 WHERE "id" = 1