app/controllers/deities_controller.rb

SELECT * FROM "deities"
---
  def index
    @deities = Deity.all

SELECT * FROM "deities" WHERE ("deities"."id" = 1)
---
  def show
    @deity = Deity.find(params[:id])

INSERT INTO "deities" ("alignment_id", "updated_at", "title", "domains", "description", "game_id", "created_at") VALUES(1, '2010-08-29 07:06:22', 'Heironeous', 'Good, Law, War', 'God of Valor', 1, '2010-08-29 07:06:22')
---
  def create
    @deity = Deity.new(params[:deity])

    respond_to do |format|
      if @deity.save