app/controllers/feats_controller.rb

SELECT * FROM "feats"
---
  def index
    @feats = Feat.all

SELECT * FROM "feats" WHERE ("feats"."id" = 1)
---
  def show
    @feat = Feat.find(params[:id])

INSERT INTO "feats" ("benefit", "updated_at", "title", "created_at") VALUES('+2 bonus on Jump and Tumble checks', '2010-08-31 04:11:40', 'Acrobatic', '2010-08-31 04:11:40')
---
  def create
    @feat = Feat.new(params[:feat])

    respond_to do |format|
      if @feat.save