app/controllers/klasses_controller.rb

  def index
    @klasses = Klass.all
---
SELECT * FROM "klasses"

  def show
    @klass = Klass.find(params[:id])
---
SELECT * FROM "klasses" WHERE ("klasses"."id" = 1)

  def edit
    @klass = Klass.find(params[:id])
---
SELECT * FROM "klasses" WHERE ("klasses"."id" = 1)

  def create
    @klass = Klass.new(params[:klass])

    respond_to do |format|
      if @klass.save
---
INSERT INTO "klasses" ("attack_bonus", "updated_at", "title", "skill_points", "hit_die", "ref_save", "fort_save", "will_save", "created_at") VALUES(1, '2010-08-27 01:59:28', 'Barbarian', 4, 12, 'f', 't', 'f', '2010-08-27 01:59:28')

  def update
    @klass = Klass.find(params[:id])
---
SELECT * FROM "klasses" WHERE ("klasses"."id" = 1)