app/controllers/skills_controller.rb

  def index
    @skills = Skill.all
---
SELECT * FROM "skills"

  def show
    @skill = Skill.find(params[:id])
---
SELECT * FROM "skills" WHERE ("skills"."id" = 1)

  def edit
    @skill = Skill.find(params[:id])
---
SELECT * FROM "skills" WHERE ("skills"."id" = 1)

  def create
    @skill = Skill.new(params[:skill])

    respond_to do |format|
      if @skill.save
---
INSERT INTO "skills" ("name", "fancy_name", "updated_at", "armor_penalty", "need_training", "game_id", "ability", "created_at") VALUES('appraise', 'Appraise', '2010-08-24 04:03:55', 0, 't', 1, 'Int', '2010-08-24 04:03:55')

  def update
    @skill = Skill.find(params[:id])

    respond_to do |format|
      if @skill.update_attributes(params[:skill])
---
SELECT * FROM "skills" WHERE ("skills"."id" = 1)
UPDATE "skills" SET "updated_at" = '2010-08-24 14:19:07', "fancy_name" = 'Knowledge (architecture & engineering)' WHERE "id" = 20