app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @users = User.all

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def show

    @user = User.find(params[:id].to_i)

INSERT INTO "users" ("prefered_class", "updated_at", "looking_for_group", "story_focused", "crypted_password", "eye_color", "username", "password_salt", "prefered_race", "gender", "tactical_focused", "combat_focused", "hair_color", "strategic_focused", "alignment", "persistence_token", "first_name", "bio", "last_name", "created_at", "email") VALUES(NULL, '2010-08-31 19:49:03', 't', 2, '8fd63ebefda18b8099b1f4d6263383b5d18d9abe01d03147d7c69fa89bdf1bd042325fc45ec5761dd69b19ec0509a86aab4b5460760f001df7cdd95dbdb7d266', NULL, 'GeneralFouFou', 'J3F1KCj7QlL4lRMsihC', NULL, 'Female', 4, 3, NULL, 1, NULL, 'ae07181ed9787e10174534a07e4b14fba5100753d42de79d8a1610fdd23632e05077a853405b0e6a2bb8384bf49f46d0bd435c179974b43dcb0b05d2a8febd8c', 'Miss', 'Just a girl, yo', 'Frisk', '2010-08-31 19:49:03', 'ssfrisk@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

UPDATE "users" SET "persistence_token" = '79cd1758a7175027bcf299e14968a1e353f91b8c62d124d986c045b5ffdffea85dc845edd95130c259f9402ccaaea5021e4b4bc9a775224e93459b93f1ad7fcb', "email" = 'ssfrisk@gmail.com', "username" = 'GeneralFouFou', "crypted_password" = 'ea5a8941d1412b385463896ceb593f48915229b8cf4e88c709a44f4a85b3e86f72e19fe83aa5f5ce0a23801c5ff321b11fd29890e8aee6e9a4383fc81057bbd1', "updated_at" = '2010-08-31 20:35:14', "password_salt" = '0C7MpoWl1nQmVG9NlDR' WHERE "id" = 1
---
  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 6)
DELETE FROM "users" WHERE "id" = 6
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy